[
  {
    "id": "ref_001",
    "file": "images/rag_pipeline_explainer.png",
    "category": "pipeline",
    "description": "Left-to-right linear pipeline with five stages: (1) input container with a question, (2) document-search step, (3) knowledge-handoff step, (4) LLM generation step, (5) output container with an answer. Arrows connect each stage sequentially. Below the pipeline: a definition box on the left third and a three-part comparison zone (Without X / With X / Leader's Insight) on the right two-thirds.",
    "tags": ["pipeline", "concept-explainer", "input-output", "definition-box"]
  },
  {
    "id": "ref_002",
    "file": "images/ai_agents_action_flow.png",
    "category": "pipeline",
    "description": "Trigger-to-outcome process chain. A trigger event on the far left connects via arrows to five numbered sequential steps, each represented by an icon and label. The steps sit inside a bounded zone with a central badge identifying the agent type. The chain terminates on the right in an outcome list of three benefit statements. A definition box sits below the flow.",
    "tags": ["pipeline", "process-chain", "trigger-to-outcome", "definition-box"]
  },
  {
    "id": "ref_003",
    "file": "images/pyne_value_chain_canvas.png",
    "category": "canvas",
    "description": "Single bordered framework grid spanning full width. Asymmetric column layout: a narrow left column (one tall cell: Context), a wide centre column (three stacked rows: Development, Capabilities, Guardrails), and a right column (two rows: Impact, Insights) whose outer edge tapers into a rightward-pointing arrow shape. Each cell contains a header, a subtitle, and a guiding question. Blank template with no data filled in.",
    "tags": ["canvas", "framework", "strategy", "grid-layout", "arrow-shape", "guiding-questions"]
  },
  {
    "id": "ref_004",
    "file": "images/development_layer_three_stages.png",
    "category": "staged-progression",
    "description": "Three equally-sized cards in a horizontal row connected by arrows. Each card contains: a number badge (1, 2, 3), an icon, a title, a role label with description text, and a guiding question at the bottom. Below the card row: two centred quotation lines.",
    "tags": ["staged-progression", "numbered", "cards", "data-value-chain", "three-stage", "quote-footer"]
  },
  {
    "id": "ref_005",
    "file": "images/insights_to_implementation_timeline.png",
    "category": "staged-progression",
    "description": "Four-phase horizontal timeline. Each phase has a title, a subtitle, and detailed description text. Vertical dividers separate the phases. Iteration loops (circles with curved return arrows) appear between the middle two phases to indicate repeatable cycles. Labeled 'Insights' markers sit above each transition point, connected in a stepped ascending path. An entry arrow leads into the first phase from above.",
    "tags": ["staged-progression", "timeline", "innovation", "phases", "iterative-loops", "insights-labels", "text-heavy"]
  },
  {
    "id": "ref_006",
    "file": "images/four_risk_categories_pinwheel.png",
    "category": "wheel",
    "description": "Four-node pinwheel arrangement in a 2×2 layout. Four circles are connected by an organic hourglass shape that pinches at the centre, forming a continuous clover-like silhouette. Each node contains an icon. Title and one-line description labels sit outside each node on its outer side. No arrows or connectors beyond the central organic shape.",
    "tags": ["hub-and-spoke", "risk", "four-quadrant", "pinwheel", "organic-shape"]
  },
  {
    "id": "ref_007",
    "file": "images/risk_realities_four_cards.png",
    "category": "comparison-cards",
    "description": "Four comparison cards in a horizontal row. Each card has a protruding icon circle at the top, a category title, a 'What it means' description section, and a 'Consequence' section with a concrete example. Cards represent distinct categories at the same level.",
    "tags": ["comparison-cards", "risk", "icon-top", "four-column", "consequence-examples", "protruding-circles"]
  },
  {
    "id": "ref_008",
    "file": "images/ai_opportunity_map.png",
    "category": "matrix",
    "description": "Split layout with two side-by-side regions. Left half: a text container with two sequential instruction steps. Right half: a 2×2 quadrant matrix with labeled axes (vertical: Impact, horizontal: Feasibility). Two opposing quadrants carry priority labels; the other two are empty. The matrix is a blank template with no data points plotted.",
    "tags": ["matrix", "2x2", "prioritisation", "quadrant", "split-layout", "template", "steps-plus-visual"]
  },
  {
    "id": "ref_009",
    "file": "images/five_questions_leaders_ai.png",
    "category": "comparison-cards",
    "description": "Five pill-shaped cards in a horizontal row with no connectors between them. Each card contains: an inset icon at the top, a category title, a guiding question, and a large number at the bottom. Cards stand independently as a numbered set.",
    "tags": ["comparison-cards", "numbered", "pill-shape", "leadership", "five-column", "icon-inset", "guiding-questions"]
  }
]
